nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/Toppers/Toppers/toppers_app/toppers_app/toppers_rx/asp/arch/rx_gcc/rx64m/rx64m.h
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 * 
 *  Copyright (C) 2016- by Hisashi Hata, JAPAN
 * 
 *  上記著作権者は，以下の(1)〜(4)の条件を満たす場合に限り，本ソフトウェ
 *  ア（本ソフトウェアを改変したものを含む．以下同じ）を使用・複製・改
 *  変・再配布（以下，利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (b) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *      また，本ソフトウェアのユーザまたはエンドユーザからのいかなる理
 *      由に基づく請求からも，上記著作権者およびTOPPERSプロジェクトを
 *      免責すること．
 * 
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，特定の使用目的
 *  に対する適合性も含めて，いかなる保証も行わない．また，本ソフトウェ
 *  アの利用により直接的または間接的に生じたいかなる損害に関しても，そ
 *  の責任を負わない．
 * 
 */

/*
 *  Rx64mに依存する定義
 */
#ifndef TOPPERS_RX64M_H
#define TOPPERS_RX64M_H

#include <sil.h>


/*
 *  CPU例外ハンドラ番号の定義(固定ベクタテーブル)
 *
 *  番号の範囲は0 - 31
 */
#define INT_PRIVILEGED_INSTRUNCTION		20		/* 特権命令例外 */
#define INT_ACCESS                      21      /* Access expression */
#define INT_UNDEF_INSTRUNCTION			23		/* 未定義命令例外 */
#define INT_FLOATINGPOINT_INSTRUCTION	25		/* 浮動小数点例外 */
#define INT_NMI							30		/* ノンマスカブル割り込み */
#define INT_RESET						31		/* リセット */

/*
 *  割込み番号の定義(可変ベクタテーブル)
 */
#define INT_BUSERR 16
#define INT_RAMERR 18
#define INT_FCU_FCUERR 21
#define INT_FUC_FRDYI 23
#define INT_ICU_SWINT2 26
#define INT_ICU_SWINT 27
#define INT_CMT0_CMI0 28
#define INT_CMT1_CMI1 29
#define INT_CMTW0_CMWI0 30
#define INT_CMTW1_CMWI1 31
#define INT_USBA_D0FIFO2 32
#define INT_USBA_D1FIFO2 33
#define INT_UBS0_D0FIFO0 34
#define INT_USB0_D1FIFO0 35
#define INT_RSPI0_SPRI0 38
#define INT_RSPI0_SPTI0 39
#define INT_QSPI_SPRI 42
#define INT_QSPI_SPTI 43
#define INT_SDHI_SBFAI 44
#define INT_MMCIF_MBFAI 45
#define INT_SSI0_SSITXI0 46
#define INT_SSI0_SSIRXI0 47
#define INT_SSI1_SSIRTI1 48
#define INT_SRC_IDEI 50
#define INT_SRC_ODFI 51
#define INT_RIIC0_RXI0 52
#define INT_RIIC0_TXI0 53
#define INT_RIIC2_RXI2 54
#define INT_RIIC2_TXI2 55
#define INT_SCI0_RXI0 58
#define INT_SCI0_TXI0 59
#define INT_SCI1_RXI1 60
#define INT_SCI1_TXI1 61
#define INT_SCI2_RXI2 62
#define INT_SCI2_TXI2 63
#define INT_IRQ0 64
#define INT_IRQ1 65
#define INT_IRQ2 66
#define INT_IRQ3 67
#define INT_IRQ4 68
#define INT_IRQ5 69
#define INT_IRQ6 70
#define INT_IRQ7 71
#define INT_IRQ8 72
#define INT_IRQ9 73
#define INT_IRQ10 74
#define INT_IRQ11 75
#define INT_IRQ12 76
#define INT_IRQ13 77
#define INT_IRQ14 78
#define INT_IRQ15 79
#define INT_SCI3_RXI3 80
#define INT_SCI3_TXI3 81
#define INT_SCI4_RXI4 82
#define INT_SCI4_TXI4 83
#define INT_SCI5_RXI5 84
#define INT_SCI5_TXI5 85
#define INT_SCI6_RXI6 86
#define INT_SCI6_TXI6 87
#define INT_LVD1_LVD1 88
#define INT_LVD2_LVD2 89
#define INT_USB0_USBR0 90
#define INT_RTC_ALM 92
#define INT_RTC_PRD 93
#define INT_USBA_UBSR 94
#define INT_IWDT_IWUNI 95
#define INT_WDT_WUNI 96
#define INT_PDC_PCDFI 97
#define INT_SCI7_RXI7 98
#define INT_SCI7_TXI7 99
#define INT_SCIFA8_RXIF8 100
#define INT_SCIFA8_TXIF8 101
#define INT_SCIFA9_RXIF9 102
#define INT_SCIFA9_TXIF9 103
#define INT_SCIFA10_RXIF10 104
#define INT_SCIFA10_TXIF10 105
#define INT_ICU_GROUPBE0 106
#define INT_ICU_GROUPBL0 110
#define INT_ICU_GROUPBL1 111
#define INT_ICU_GROUPAL0 112
#define INT_ICU_GROUPAL1 113
#define INT_SCIFA11_RXIF11 114
#define INT_SCIFA11_TXIF11 115
#define INT_SCI12_RXI12 116
#define INT_SCI12_TXI12 117
#define INT_DMAC_DMAC0I 120
#define INT_DMAC_DMAC1I 121
#define INT_DMAC_DMAC2I 122
#define INT_DMAC_DMAC3I 123
#define INT_DMAC_DMAC74I 124
#define INT_OST_OSTDI 125
#define INT_EXDMAC_EXDMAC0I 126
#define INT_EXDMAC_EXDMAC1I 127
#define INT_PERIB_INTB128 128
#define INT_PERIB_INTB129 129
#define INT_PERIB_INTB130 130
#define INT_PERIB_INTB131 131
#define INT_PERIB_INTB132 132
#define INT_PERIB_INTB133 133
#define INT_PERIB_INTB134 134
#define INT_PERIB_INTB135 135
#define INT_PERIB_INTB136 136
#define INT_PERIB_INTB137 137
#define INT_PERIB_INTB138 138
#define INT_PERIB_INTB139 139
#define INT_PERIB_INTB140 140
#define INT_PERIB_INTB141 141
#define INT_PERIB_INTB142 142
#define INT_PERIB_INTB143 143
#define INT_PERIB_INTB144 144
#define INT_PERIB_INTB145 145
#define INT_PERIB_INTB146 146
#define INT_PERIB_INTB147 147
#define INT_PERIB_INTB148 148
#define INT_PERIB_INTB149 149
#define INT_PERIB_INTB150 150
#define INT_PERIB_INTB151 151
#define INT_PERIB_INTB152 152
#define INT_PERIB_INTB153 153
#define INT_PERIB_INTB154 154
#define INT_PERIB_INTB155 155
#define INT_PERIB_INTB156 156
#define INT_PERIB_INTB157 157
#define INT_PERIB_INTB158 158
#define INT_PERIB_INTB159 159
#define INT_PERIB_INTB160 160
#define INT_PERIB_INTB161 161
#define INT_PERIB_INTB162 162
#define INT_PERIB_INTB163 163
#define INT_PERIB_INTB164 164
#define INT_PERIB_INTB165 165
#define INT_PERIB_INTB166 166
#define INT_PERIB_INTB167 167
#define INT_PERIB_INTB168 168
#define INT_PERIB_INTB169 169
#define INT_PERIB_INTB170 170
#define INT_PERIB_INTB171 171
#define INT_PERIB_INTB172 172
#define INT_PERIB_INTB173 173
#define INT_PERIB_INTB174 174
#define INT_PERIB_INTB175 175
#define INT_PERIB_INTB176 176
#define INT_PERIB_INTB177 177
#define INT_PERIB_INTB178 178
#define INT_PERIB_INTB179 179
#define INT_PERIB_INTB180 180
#define INT_PERIB_INTB181 181
#define INT_PERIB_INTB182 182
#define INT_PERIB_INTB183 183
#define INT_PERIB_INTB184 184
#define INT_PERIB_INTB185 185
#define INT_PERIB_INTB186 186
#define INT_PERIB_INTB187 187
#define INT_PERIB_INTB188 188
#define INT_PERIB_INTB189 189
#define INT_PERIB_INTB190 190
#define INT_PERIB_INTB191 191
#define INT_PERIB_INTB192 192
#define INT_PERIB_INTB193 193
#define INT_PERIB_INTB194 194
#define INT_PERIB_INTB195 195
#define INT_PERIB_INTB196 196
#define INT_PERIB_INTB197 197
#define INT_PERIB_INTB198 198
#define INT_PERIB_INTB199 199
#define INT_PERIB_INTB200 200
#define INT_PERIB_INTB201 201
#define INT_PERIB_INTB202 202
#define INT_PERIB_INTB203 203
#define INT_PERIB_INTB204 204
#define INT_PERIB_INTB205 205
#define INT_PERIB_INTB206 206
#define INT_PERIB_INTB207 207
#define INT_PERIA_INTA208 208
#define INT_PERIA_INTA209 209
#define INT_PERIA_INTA210 210
#define INT_PERIA_INTA211 211
#define INT_PERIA_INTA212 212
#define INT_PERIA_INTA213 213
#define INT_PERIA_INTA214 214
#define INT_PERIA_INTA215 215
#define INT_PERIA_INTA216 216
#define INT_PERIA_INTA217 217
#define INT_PERIA_INTA218 218
#define INT_PERIA_INTA219 219
#define INT_PERIA_INTA220 220
#define INT_PERIA_INTA221 221
#define INT_PERIA_INTA222 222
#define INT_PERIA_INTA223 223
#define INT_PERIA_INTA224 224
#define INT_PERIA_INTA225 225
#define INT_PERIA_INTA226 226
#define INT_PERIA_INTA227 227
#define INT_PERIA_INTA228 228
#define INT_PERIA_INTA229 229
#define INT_PERIA_INTA230 230
#define INT_PERIA_INTA231 231
#define INT_PERIA_INTA232 232
#define INT_PERIA_INTA233 233
#define INT_PERIA_INTA234 234
#define INT_PERIA_INTA235 235
#define INT_PERIA_INTA236 236
#define INT_PERIA_INTA237 237
#define INT_PERIA_INTA238 238
#define INT_PERIA_INTA239 239
#define INT_PERIA_INTA240 240
#define INT_PERIA_INTA241 241
#define INT_PERIA_INTA242 242
#define INT_PERIA_INTA243 243
#define INT_PERIA_INTA244 244
#define INT_PERIA_INTA245 245
#define INT_PERIA_INTA246 246
#define INT_PERIA_INTA247 247
#define INT_PERIA_INTA248 248
#define INT_PERIA_INTA249 249
#define INT_PERIA_INTA250 250
#define INT_PERIA_INTA251 251
#define INT_PERIA_INTA252 252
#define INT_PERIA_INTA253 253
#define INT_PERIA_INTA254 254
#define INT_PERIA_INTA255 255

