nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/Toppers/Toppers/toppers_app/toppers_app/toppers_rx/asp/arch/rx_gcc/rx64m/rx64m.h
/*
 * number of the selectable interrupt B
 */
#define ISELB_CMT2_CMI2 1
#define ISELB_CMT3_CMI3 2
#define ISELB_TMR0_CMIA0 3
#define ISELB_TMR0_CMIB0 4
#define ISELB_TMR0_OVI0 5
#define ISELB_TMR1_CMIA1 6
#define ISELB_TMR1_CMIB1 7
#define ISELB_TMR1_OVI1 8
#define ISELB_TMR2_CMIA2 9
#define ISELB_TMR2_CMIB2 10
#define ISELB_TMR2_OVI2 11
#define ISELB_TMR3_CMIA3 12
#define ISELB_TMR3_CMIB3 13
#define ISELB_TMR3_OVI3 14
#define ISELB_TPU0_TGI0A 15
#define ISELB_TPU0_TGI0B 16
#define ISELB_TPU0_TGI0C 17
#define ISELB_TPU0_TGI0D 18
#define ISELB_TPU0_TCI0V 19
#define ISELB_TPU1_TGI1A 20
#define ISELB_TPU1_TGI1B 21
#define ISELB_TPU1_TCI1V 22
#define ISELB_TPU1_TCI1U 23
#define ISELB_TPU2_TGI2A 24
#define ISELB_TPU2_TGI2B 25
#define ISELB_TPU2_TCI2V 26
#define ISELB_TPU2_TCI2U 27
#define ISELB_TPU3_TGI3A 28
#define ISELB_TPU3_TGI3B 29
#define ISELB_TPU3_TGI3C 30
#define ISELB_TPU3_TGI3D 31
#define ISELB_TPU3_TCI3V 32
#define ISELB_TPU4_TGI4A 33
#define ISELB_TPU4_TGI4B 34
#define ISELB_TPU4_TCI4V 35
#define ISELB_TPU4_TCI4U 36
#define ISELB_TPU5_TGI5A 37
#define ISELB_TPU5_TGI5B 38
#define ISELB_TPU5_TCI5V 39
#define ISELB_TPU5_TCI5U 40
#define ISELB_CMTW0_IC0I0 41
#define ISELB_CMTW0_IC1I0 42
#define ISELB_CMTW0_OC0I0 43
#define ISELB_CMTW0_OC1I0 44
#define ISELB_CMTW0_CMTW1 45
#define ISELB_CMTW0_IC1I1 46
#define ISELB_CMTW0_OC0I1 47
#define ISELB_CMTW0_OC1I1 48
#define ISELB_RTC_CUP 49
#define ISELB_CAN0_RXF0 50
#define ISELB_CAN0_TXF0 51
#define ISELB_CAN0_RXM0 52
#define ISELB_CAN0_TXM0 53
#define ISELB_CAN1_RXF1 54
#define ISELB_CAN1_TXF1 55
#define ISELB_CAN1_RXM1 56
#define ISELB_CAN1_TXM1 57
#define ISELB_CAN2_RXF2 58
#define ISELB_CAN2_TXF2 59
#define ISELB_CAN2_RXM2 60
#define ISELB_CAN2_TXM2 61
#define ISELB_USB0_USBI0 62
#define ISELB_S12AD_S12ADI 64
#define ISELB_S12AD_S12GBADI 65
#define ISELB_S12AD1_S12ADI1 68
#define ISELB_S12AD1_S12GBADI1 69
#define ISELB_DES_DESEND 73
#define ISELB_SHA_SHADEND 74
#define ISELB_SHA_SHAEND 75
#define ISELB_RNG_RNGEND 76
#define ISELB_ELC_ELSR18I 79
#define ISELB_ELC_ELSR19I 80
/*
 * number of the selectable interrupt A
 */
#define ISELA_MTU0_TGIA0 1
#define ISELA_MTU0_TGIB0 2
#define ISELA_MTU0_TGIC0 3
#define ISELA_MTU0_TGID0 4
#define ISELA_MTU0_TCIV0 5
#define ISELA_MTU0_TGIE0 6
#define ISELA_MTU0_TGIF0 7
#define ISELA_MTU1_TGIA1 8
#define ISELA_MTU1_TGIB1 9
#define ISELA_MTU1_TCIV1 10
#define ISELA_MTU1_TCIU1 11
#define ISELA_MTU2_TGIA2 12
#define ISELA_MTU2_TGIB2 13
#define ISELA_MTU2_TCIV2 14
#define ISELA_MTU2_TCIU2 15
#define ISELA_MTU3_TGIA3 16
#define ISELA_MTU3_TGIB3 17
#define ISELA_MTU3_TGIC3 18
#define ISELA_MTU3_TGID3 19
#define ISELA_MTU3_TCIV3 20
#define ISELA_MTU4_TGIA4 21
#define ISELA_MTU4_TGIB4 22
#define ISELA_MTU4_TGIC4 23
#define ISELA_MTU4_TGID4 24
#define ISELA_MTU4_TCIV4 25
#define ISELA_MTU5_TGIU5 27
#define ISELA_MTU5_TGIV5 28
#define ISELA_MTU5_TGIW5 29
#define ISELA_MTU6_TGIA6 30
#define ISELA_MTU6_TGIB6 31
#define ISELA_MTU6_TGIC6 32
#define ISELA_MTU6_TGID6 33
#define ISELA_MTU6_TCIV6 34
#define ISELA_MTU7_TGIA7 35
#define ISELA_MTU7_TGIB7 36
#define ISELA_MTU7_TGIC7 37
#define ISELA_MTU7_TGID7 38
#define ISELA_MTU7_TCIV7 39
#define ISELA_MTU8_TGIA8 41
#define ISELA_MTU8_TGIB8 42
#define ISELA_MTU8_TGIC8 43
#define ISELA_MTU8_TGID8 44
#define ISELA_MTU8_TCIV8 45
#define ISELA_GPT0_GTCIA0 47
#define ISELA_GPT0_GTCIB0 48
#define ISELA_GPT0_GTCIC0 49
#define ISELA_GPT0_GTCID0 50
#define ISELA_GPT0_GDTE0 51
#define ISELA_GPT0_GTCIE0 52
#define ISELA_GPT0_GTCIF0 53
#define ISELA_GPT0_GTCIV0 54
#define ISELA_GPT0_GTCIU0 55
#define ISELA_GPT_COMMON_ETGIN 56
#define ISELA_GPT_COMMON_ETGIP 57
#define ISELA_GPT1_GTCIA1 58
#define ISELA_GPT1_GTCIB1 59
#define ISELA_GPT1_GTCIC1 60
#define ISELA_GPT1_GTCID1 61
#define ISELA_GPT1_GDTE1 62
#define ISELA_GPT1_GTCIE1 63
#define ISELA_GPT1_GTCIF1 64
#define ISELA_GPT1_GTCIV1 65
#define ISELA_GPT1_GTCIU1 66
#define ISELA_GPT2_GTCIA2 67
#define ISELA_GPT2_GTCIB2 68
#define ISELA_GPT2_GTCIC2 69
#define ISELA_GPT2_GTCID2 70
#define ISELA_GPT2_GDTE2 71
#define ISELA_GPT2_GTCIE2 72
#define ISELA_GPT2_GTCIF2 73
#define ISELA_GPT2_GTCIV2 74
#define ISELA_GPT2_GTCIU2 75
#define ISELA_GPT3_GTCIA3 76
#define ISELA_GPT3_GTCIB3 77
#define ISELA_GPT3_GTCIC3 78
#define ISELA_GPT3_GTCID3 79
#define ISELA_GPT3_GDTE3 80
#define ISELA_GPT3_GTCIE3 81
#define ISELA_GPT3_GTCIF3 82
#define ISELA_GPT3_GTCIV3 83
#define ISELA_GPT3_GTCIU3 84
#define ISELA_EPTPC_IPLS 86
#define ISELA_AES_AESRDY 88
#define ISELA_AES_AESEND 89

/*
 * 割り込み要求レジスタ
 */

#define ICU_IR_BASE 0x00087000
#define ICU_IR_BIT        ( 1U << 0U )


/*
 * 割り込み要求許可レジスタ
 */
#define ICU_IER_BASE 0x00087200
/*
 *GROUP interrupt register
 */
//Group interrupt status register
#define ICU_GRPBE0_ADDR ((volatile uint32_t *)0x00087600)
#define ICU_GRPBL0_ADDR ((volatile uint32_t *)0x00087630)
#define ICU_GRPBL1_ADDR ((volatile uint32_t *)0x00087634)
#define ICU_GRPAL0_ADDR ((volatile uint32_t *)0x00087830)
#define ICU_GRPAL1_ADDR ((volatile uint32_t *)0x00087834)
//Group interrupt request enable register
#define ICU_GENBE0_ADDR ((volatile uint32_t *)0x00087640)
#define ICU_GENBL0_ADDR ((volatile uint32_t *)0x00087670)
#define ICU_GENBL1_ADDR ((volatile uint32_t *)0x00087674)
#define ICU_GENAL0_ADDR ((volatile uint32_t *)0x00087870)
#define ICU_GENAL1_ADDR ((volatile uint32_t *)0x00087874)
//Group BE0 intterupt clear register
#define ICU_GCRBE0_ADDR ((volatile uint32_t *)0x00087680)

//the bit of the groupt intterupt device
//BE0 group intterupt
#define GROUP_BE0_B0_CAN0_ERS0 0x1
#define GROUP_BE0_B1_CAN1_ERS1 0x2
#define GROUP_BE0_B2_CAN2_ERS2 0x4
//BL0 group intterupt
#define GROUP_BL0_B0_SCI0_TEI0 (1UL << 0U)
#define GROUP_BL0_B1_SCI0_ERI0 (1UL << 1U)
#define GROUP_BL0_B2_SCI1_TEI1 (1UL << 2U)
#define GROUP_BL0_B3_SCI1_ERI1 (1UL << 3U)
#define GROUP_BL0_B4_SCI2_TEI2 (1UL << 4U)
#define GROUP_BL0_B5_SCI2_ERI2 (1UL << 5U)
#define GROUP_BL0_B6_SCI3_TEI3 (1UL << 6U)
#define GROUP_BL0_B7_SCI3_ERI3 (1UL << 7U)
#define GROUP_BL0_B8_SCI4_TEI4 (1UL << 8U)
#define GROUP_BL0_B9_SCI4_ERI4 (1UL << 9U)
#define GROUP_BL0_B10_SCI5_TEI5 (1UL << 10U)
#define GROUP_BL0_B11_SCI5_ERI5 (1UL << 11U)
#define GROUP_BL0_B12_SCI6_TEI6 (1UL << 12U)
#define GROUP_BL0_B13_SCI6_ERI6 (1UL << 13U)
#define GROUP_BL0_B14_SCI7_TEI7 (1UL << 14U)
#define GROUP_BL0_B15_SCI7_ERI7 (1UL << 15U)
#define GROUP_BL0_B16_SCI12_TEI12 (1UL << 16U)
#define GROUP_BL0_B17_SCI12_ERI12 (1UL << 17U)
#define GROUP_BL0_B18_SCI12_SCIX0 (1UL << 18U)
#define GROUP_BL0_B19_SCI12_SCIX1 (1UL << 19U)
#define GROUP_BL0_B20_SCI12_SCIX2 (1UL << 20U)
#define GROUP_BL0_B21_SCI12_SCIX3 (1UL << 21U)
#define GROUP_BL0_B24_QSPI_QSPSSLI (1UL << 24U)
#define GROUP_BL0_B26_CAC_FERRI (1UL << 26U)
#define GROUP_BL0_B27_CAC_MENDI (1UL << 27U)
#define GROUP_BL0_B28_CAC_OVFI (1UL << 28U)
#define GROUP_BL0_B29_DOC_DOPCI (1UL << 29U)
#define GROUP_BL0_B30_PDC_PCFEI (1UL << 30U)
#define GROUP_BL0_B31_PDC_PCERI (1UL << 31U)
//BL1 group intterupt
#define GROUP_BL1_B0_SRC_OVFI (1UL << 0U)
#define GROUP_BL1_B1_SRC_UDFI (1UL << 1U)
#define GROUP_BL1_B2_SRC_CEFI (1UL << 2U)
#define GROUP_BL1_B3_SDHI_CDETI (1UL << 3U)
#define GROUP_BL1_B4_SDHI_CACI (1UL << 4U)
#define GROUP_BL1_B5_SDHI_SDACI (1UL << 5U)
#define GROUP_BL1_B6_MMCIF_CDETIO (1UL << 6U)
#define GROUP_BL1_B7_MMCIF_ERRIO (1UL << 7U)
#define GROUP_BL1_B8_MMCIF_ACCIO (1UL << 8U)
#define GROUP_BL1_B9_POE3_OEI1 (1UL << 9U)
#define GROUP_BL1_B10_POE3_OEI2 (1UL << 10U)
#define GROUP_BL1_B11_POE3_OEI3 (1UL << 11U)
#define GROUP_BL1_B12_POE3_OEI4 (1UL << 12U)
#define GROUP_BL1_B13_RIIC0_TEI0 (1UL << 13U)
#define GROUP_BL1_B14_RIIC0_EEI0 (1UL << 14U)
#define GROUP_BL1_B15_RIIC2_TEI2 (1UL << 15U)
#define GROUP_BL1_B16_RIIC2_EEI2 (1UL << 16U)
#define GROUP_BL1_B17_SSI0_SSIF0 (1UL << 17U)
#define GROUP_BL1_B18_SSI1_SSIF1 (1UL << 18U)
#define GROUP_BL1_B20_S12AD_A12CMPI (1UL << 20U)
#define GROUP_BL1_B22_S12AD1_S12CMPI1 (1UL << 22U)
//AL0 group intterupt
#define GROUP_AL0_B0_SCIFA8_TEIF8 (1UL << 0U)
#define GROUP_AL0_B1_SCIFA8_ERIF8 (1UL << 1U)
#define GROUP_AL0_B2_SCIFA8_BRIF8 (1UL << 2U)
#define GROUP_AL0_B3_SCIFA8_DRIF8 (1UL << 3U)
#define GROUP_AL0_B4_SCIFA9_TEIF9 (1UL << 4U)
#define GROUP_AL0_B5_SCIFA9_ERIF9 (1UL << 5U)
#define GROUP_AL0_B6_SCIFA9_BRIF9 (1UL << 6U)
#define GROUP_AL0_B7_SCIFA9_DRIF9 (1UL << 7U)
#define GROUP_AL0_B8_SCIFA10_TEIF10 (1UL << 8U)
#define GROUP_AL0_B9_SCIFA10_ERIF10 (1UL << 9U)
#define GROUP_AL0_B10_SCIFA10_BRIF10 (1UL << 10U)
#define GROUP_AL0_B11_SCIFA10_DRIF10 (1UL << 11U)
#define GROUP_AL0_B12_SCIFA11_TEIF11 (1UL << 12U)
#define GROUP_AL0_B13_SCIFA11_ERIF11 (1UL << 13U)
#define GROUP_AL0_B14_SCIFA11_BRIF11 (1UL << 14U)
#define GROUP_AL0_B15_SCIFA11_DRIF11 (1UL << 15U)
#define GROUP_AL0_B16_RSPI0_SPII0 (1UL << 16U)
#define GROUP_AL0_B17_RSPI0_SPEI0 (1UL << 17U)
//AL1 group intterupt
#define GROUP_AL1_B0_EPTPC_MINT (1UL << 0U)
#define GROUP_AL1_B1_PTPEDMAC_PINT (1UL << 1U)
#define GROUP_AL1_B4_EDMAC0_EINT0 (1UL << 4U)
#define GROUP_AL1_B5_EDMAC1_EINT1 (1UL << 5U)

