nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/Toppers/Toppers/toppers_app/toppers_app/toppers_rx/asp/arch/rx_gcc/rx64m/rx64m.h
/*
 *  各モジュールのレジスタ及び設定ビット情報
 */

/*
 *  Register write protection 
 */ 
#define SYSTEM_MDMONR_ADDR ((uint16_t *)0x00080000)
#define SYSTEM_MDMONR_MD_LOW 0x0
#define SYSTEM_MDMONR_MD_HIGH 0x0

#define SYSTEM_MDSR_ADDR ((uint16_t *)0x00080002)
#define SYSTEM_MDSR_UBTS_MASK 0x20
#define SYSTEM_MDSR_UBTS_SINGLE 0x0
#define SYSTEM_MDSR_UBTS_USER 0x20

#define SYSTEM_SYSCR0_ADDR ((uint16_t *)0x00080006)
#define SYSTEM_SYSCR0_ROME_EN 0x1
#define SYSTEM_SYSCR0_ROME_DIS 0x0
#define SYSTEM_SYSCR0_EXBE_EN 0x2
#define SYSTEM_SYSCR0_EXBE_DIS 0x0
#define SYSTEM_SYSCR0_KEY 0x5A00

#define SYSTEM_SYSCR1_ADDR ((uint16_t *)0x00080008)
#define SYSTEM_SYSCR1_RAME_EN 0x1
#define SYSTEM_SYSCR1_RAME_DIS 0x0
#define SYSTEM_SYSCR1_ECCRAME_EN 0x4
#define SYSTEM_SYSCR1_ECCRAME_DIS 0x0
#define SYSTEM_SYSCR1_SBYRAME_EN 0x8
#define SYSTEM_SYSCR1_SBYRAME_DIS 0x0
#define SYSTEM_SYSCR1_RESERV 0x3E

#define SYSTEM_PRCR_ADDR ( 0x000803FE )
#define SYSTEM_PRKEY  0xA500
#define SYSTEM_PRC0	( 1UL << 0U )
#define SYSTEM_PRC1	( 1UL << 1U )
#define SYSTEM_PRC3	( 1UL << 3U )

/*
 * Clock generater 
 */
//SCKCR define
#define CKG_SCKCR_ADDR ( ( volatile uint32_t *)0x00080020 )
#define CKG_SCKCR_PD_DIV01 ( 0UL )
#define CKG_SCKCR_PD_DIV02 ( 1UL )
#define CKG_SCKCR_PD_DIV04 ( 2UL )
#define CKG_SCKCR_PD_DIV08 ( 3UL )
#define CKG_SCKCR_PD_DIV16 ( 4UL )
#define CKG_SCKCR_PD_DIV32 ( 5UL )
#define CKG_SCKCR_PD_DIV64 ( 6UL )
#define CKG_SCKCR_PC_DIV01 ( 0UL << 4 )
#define CKG_SCKCR_PC_DIV02 ( 1UL << 4 )
#define CKG_SCKCR_PC_DIV04 ( 2UL << 4 )
#define CKG_SCKCR_PC_DIV08 ( 3UL << 4 )
#define CKG_SCKCR_PC_DIV16 ( 4UL << 4 )
#define CKG_SCKCR_PC_DIV32 ( 5UL << 4 )
#define CKG_SCKCR_PC_DIV64 ( 6UL << 4 )
#define CKG_SCKCR_PB_DIV01 ( 0UL << 8 )
#define CKG_SCKCR_PB_DIV02 ( 1UL << 8 )
#define CKG_SCKCR_PB_DIV04 ( 2UL << 8 )
#define CKG_SCKCR_PB_DIV08 ( 3UL << 8 )
#define CKG_SCKCR_PB_DIV16 ( 4UL << 8 )
#define CKG_SCKCR_PB_DIV32 ( 5UL << 8 )
#define CKG_SCKCR_PB_DIV64 ( 6UL << 8 )
#define CKG_SCKCR_PA_DIV01 ( 0UL << 12 )
#define CKG_SCKCR_PA_DIV02 ( 1UL << 12 )
#define CKG_SCKCR_PA_DIV04 ( 2UL << 12 )
#define CKG_SCKCR_PA_DIV08 ( 3UL << 12 )
#define CKG_SCKCR_PA_DIV16 ( 4UL << 12 )
#define CKG_SCKCR_PA_DIV32 ( 5UL << 12 )
#define CKG_SCKCR_PA_DIV64 ( 6UL << 12 )
#define CKG_SCKCR_BCK_DIV01 ( 0UL << 16 )
#define CKG_SCKCR_BCK_DIV02 ( 1UL << 16 )
#define CKG_SCKCR_BCK_DIV04 ( 2UL << 16 )
#define CKG_SCKCR_BCK_DIV08 ( 3UL << 16 )
#define CKG_SCKCR_BCK_DIV16 ( 4UL << 16 )
#define CKG_SCKCR_BCK_DIV32 ( 5UL << 16 )
#define CKG_SCKCR_BCK_DIV64 ( 6UL << 16 )
#define CKG_SCKCR_PSTOP0 ( 1UL << 22 )
#define CKG_SCKCR_PSTOP1 ( 1UL << 23 )
#define CKG_SCKCR_ICK_DIV01  ( 0UL << 24 )
#define CKG_SCKCR_ICK_DIV02  ( 1UL << 24 )
#define CKG_SCKCR_ICK_DIV04  ( 2UL << 24 )
#define CKG_SCKCR_ICK_DIV08  ( 3UL << 24 )
#define CKG_SCKCR_ICK_DIV16  ( 4UL << 24 )
#define CKG_SCKCR_ICK_DIV32  ( 5UL << 24 )
#define CKG_SCKCR_ICK_DIV64  ( 6UL << 24 )
#define CKG_SCKCR_FCK_DIV01  ( 0UL << 28 )
#define CKG_SCKCR_FCK_DIV02  ( 1UL << 28 )
#define CKG_SCKCR_FCK_DIV04  ( 2UL << 28 )
#define CKG_SCKCR_FCK_DIV08  ( 3UL << 28 )
#define CKG_SCKCR_FCK_DIV16  ( 4UL << 28 )
#define CKG_SCKCR_FCK_DIV32  ( 5UL << 28 )
#define CKG_SCKCR_FCK_DIV64  ( 6UL << 28 )

#define CKG_SCKCR2_ADDR ( ( volatile uint16_t *)0x00080024 )
#define CKG_SCKCR2_UCK_NOT_USE (1UL << 4)
#define CKG_SCKCR2_UCK_DIV2 (1UL << 4)
#define CKG_SCKCR2_UCK_DIV3 (2UL << 4)
#define CKG_SCKCR2_UCK_DIV4 (3UL << 4)
#define CKG_SCKCR2_UCK_DIV5 (4UL << 4)


//CLock Select register
#define CKG_SCKCR3_ADDR ( ( volatile uint16_t *)0x00080026 )
#define CKG_SCKCR3_CKSEL_LOCO ( 0UL << 8 )
#define CKG_SCKCR3_CKSEL_HOCO ( 1UL << 8 )
#define CKG_SCKCR3_CKSEL_MAIN ( 2UL << 8 )
#define CKG_SCKCR3_CKSEL_SUB ( 3UL << 8 )
#define CKG_SCKCR3_CKSEL_PLL ( 4UL << 8 )
//PLL freq setting
#define CKG_PLLCR_ADDR ( ( volatile uint16_t *)0x00080028 )
#define CKG_PLLCR_PLIDIV1 ( 0UL << 0U )
#define CKG_PLLCR_PLIDIV2 ( 1UL << 0U )
#define CKG_PLLCR_PLIDIV3 ( 2UL << 0U )
#define CKG_PLLCR_PLLSRCSEL_MAIN (0U << 4)
#define CKG_PLLCR_PLLSRCSEL_HOCO (1U << 4)
#define CKG_PLLCR_STC10_0 ( 0x13UL << 8U )
#define CKG_PLLCR_STC10_5 ( 0x14UL << 8U )
#define CKG_PLLCR_STC11_0 ( 0x15UL << 8U )
#define CKG_PLLCR_STC11_5 ( 0x16UL << 8U )
#define CKG_PLLCR_STC12_0 ( 0x17UL << 8U )
#define CKG_PLLCR_STC12_5 ( 0x18UL << 8U )
#define CKG_PLLCR_STC13_0 ( 0x19UL << 8U )
#define CKG_PLLCR_STC13_5 ( 0x1AUL << 8U )
#define CKG_PLLCR_STC14_0 ( 0x1BUL << 8U )
#define CKG_PLLCR_STC14_5 ( 0x1CUL << 8U )
#define CKG_PLLCR_STC15_0 ( 0x1DUL << 8U )
#define CKG_PLLCR_STC15_5 ( 0x1EUL << 8U )
#define CKG_PLLCR_STC16_0 ( 0x1FUL << 8U )
#define CKG_PLLCR_STC16_5 ( 0x20UL << 8U )
#define CKG_PLLCR_STC17_0 ( 0x21UL << 8U )
#define CKG_PLLCR_STC17_5 ( 0x22UL << 8U )
#define CKG_PLLCR_STC18_0 ( 0x23UL << 8U )
#define CKG_PLLCR_STC18_5 ( 0x24UL << 8U )
#define CKG_PLLCR_STC19_0 ( 0x25UL << 8U )
#define CKG_PLLCR_STC19_5 ( 0x26UL << 8U )
#define CKG_PLLCR_STC20_0 ( 0x27UL << 8U )
#define CKG_PLLCR_STC20_5 ( 0x28UL << 8U )
#define CKG_PLLCR_STC21_0 ( 0x29UL << 8U )
#define CKG_PLLCR_STC21_5 ( 0x2AUL << 8U )
#define CKG_PLLCR_STC22_0 ( 0x2BUL << 8U )
#define CKG_PLLCR_STC22_5 ( 0x2CUL << 8U )
#define CKG_PLLCR_STC23_0 ( 0x2DUL << 8U )
#define CKG_PLLCR_STC23_5 ( 0x2EUL << 8U )
#define CKG_PLLCR_STC24_0 ( 0x2FUL << 8U )
#define CKG_PLLCR_STC24_5 ( 0x30UL << 8U )
#define CKG_PLLCR_STC25_0 ( 0x31UL << 8U )
#define CKG_PLLCR_STC25_5 ( 0x32UL << 8U )
#define CKG_PLLCR_STC26_0 ( 0x33UL << 8U )
#define CKG_PLLCR_STC26_5 ( 0x34UL << 8U )
#define CKG_PLLCR_STC27_0 ( 0x35UL << 8U )
#define CKG_PLLCR_STC27_5 ( 0x36UL << 8U )
#define CKG_PLLCR_STC28_0 ( 0x37UL << 8U )
#define CKG_PLLCR_STC28_5 ( 0x38UL << 8U )
#define CKG_PLLCR_STC29_0 ( 0x39UL << 8U )
#define CKG_PLLCR_STC29_5 ( 0x3AUL << 8U )
#define CKG_PLLCR_STC30_0 ( 0x3BUL << 8U )
//Clock enable setting
#define CKG_PLLCR2_ADDR ( ( volatile uint16_t *)0x0008002A )
#define CKG_MOSCCR_ADDR ( ( volatile uint8_t *)0x00080032 )
#define CKG_SOSCCR_ADDR ( ( volatile uint8_t *)0x00080033 )
#define CKG_LOSCCR_ADDR ( ( volatile uint8_t *)0x00080034 )
#define CKG_ILOCOCR_ADDR ( ( volatile uint8_t *)0x00080035 )
#define CKG_HOCOCR_ADDR ( ( volatile uint8_t *)0x00080036 )

#define CKG_CLOCK_ENABLE  0UL
#define CKG_CLOCK_DISABLE 1UL

//HOCOCR control
#define CKG_HOCOCR2_ADDR ( ( volatile uint8_t *)0x00080037 )
#define CKG_HOCOCR2_HCFRQ16 (0x0U)
#define CKG_HOCOCR2_HCFRQ18 (0x1U)
#define CKG_HOCOCR2_HCFRQ20 (0x2U)

//OCOVFSR register
#define CKG_OSCOVFSR_ADDR ( ( volatile uint8_t *)0x0008003C )
#define CKG_OSCOVFSR_MOOVF_STOP (0x0U)
#define CKG_OSCOVFSR_MOOVF_RUN (0x1U )
#define CKG_OSCOVFSR_MOOVF_MASK (0x1U )
#define CKG_OSCOVFSR_SOOVF_STOP (0x0U)
#define CKG_OSCOVFSR_SOOVF_RUN (0x2U)
#define CKG_OSCOVFSR_SOOVF_MASK (0x2U)
#define CKG_OSCOVFSR_PLOVF_STOP (0x0U)
#define CKG_OSCOVFSR_PLOVF_RUN (0x4U)
#define CKG_OSCOVFSR_PLOVF_MASK (0x4U)
#define CKG_OSCOVFSR_HCOVF_STOP (0x0U)
#define CKG_OSCOVFSR_HCOVF_RUN (0x8U)
#define CKG_OSCOVFSR_HCOVF_MASK (0x8U)
#define CKG_OSCOVFSR_ILCOVF_STOP (0x0U)
#define CKG_OSCOVFSR_ILCOVF_RUN (0x10U)
#define CKG_OSCOVFSR_ILCOVF_MASK (0x10U)

//OSTDCR register
#define CKG_OSTDCR_ADDR ( ( volatile uint8_t *)0x00080040 )
#define CKG_OSTDCR_OSTDIE_DIS (0x0U)
#define CKG_OSTDCR_OSTDIE_EN (0x1U)
#define CKG_OSTDCR_OSTDE_DIS (0x0U)
#define CKG_OSTDCR_OSTDE_EN (0x80U)

//OSTDSR Register
#define CKG_OSTDSR_ADDR ( ( volatile uint8_t *)0x00080041 )
#define CKG_OSTDSR_OSTDF_RUN (0x0U)
#define CKG_OSTDCR_OSTDF_STOP (0x1U)
#define CKG_OSTDCR_OSTDF_MASK (0x1U)

//MOFCR Register
#define CKG_MOFCR_ADDR ( ( volatile uint8_t *)0x0008C293 )
#define CKG_MOFCR_MOFXIN_FORCE_EN (0x1)
#define CKG_MOFCR_MOFXIN_FREE (0x0)
#define CKG_MOFCR_MODRV2_U24 (0x0)
#define CKG_MOFCR_MODRV2_U20 (0x10)
#define CKG_MOFCR_MODRV2_U16 (0x20)
#define CKG_MOFCR_MODRV2_U8 (0x30)
#define CKG_MOFCR_MOSEL_OSC (0x0)
#define CKG_MOFCR_MOSEL_EXCLK (0x40)

