nekoman2187/wolfssl/IDE/Renesas/e2studio/RX72N/EnvisionKit_Toppers/Toppers/Toppers/toppers_app/toppers_app/toppers_rx/asp/arch/rx_gcc/rx64m/rx64m.h
/*
 * DTCER Register
 */
#define ICU_DTCER_BASE 0x00087100
#define EN_ICU_DTCER_BIT 0x1
#define DIS_ICU_DTCER_BIT 0x0

#ifndef TOPPERS_MACRO_ONLY
#define ENABLE_ICU_DTCER(intno)  (*((volatile uint8_t *)(ICU_DTCER_BASE + intno)) = EN_ICU_DTCER_BIT)

#define DISABLE_ICU_DTCER(intno) (*((volatile uint8_t *)(ICU_DTCER_BASE + intno)) = DIS_ICU_DTCER_BIT)
#endif


#define ICU_IRQCR_BASE 0x00087500
#define SET_ICU_IRQCR(intno, sel_edge) (*((volatile uint8_t *)(ICU_IRQCR_BASE | intno)) = sel_edge)

/*
 * DTCa address define
 */

#define DTCA_BASE_ADDR 0x00082400

/*
 *  各チャンネルのレジスタ及び設定ビット情報
 */

#define CMT_CMSTR0_ADDR      ( ( volatile uint16_t  * )0x00088000 )
#define CMT_CMSTR0_STR0_BIT    ( 1U << 0U )
#define CMT_CMSTR0_STR1_BIT    ( 1U << 1U )
#define CMT_CMSTR1_ADDR      ( ( volatile uint16_t  * )0x00088010 )
#define CMT_CMSTR1_STR2_BIT    ( 1U << 0U )
#define CMT_CMSTR1_STR3_BIT    ( 1U << 1U )
#define CMT0_CMCR_ADDR      ( ( volatile uint16_t  * )0x00088002 )
#define CMT0_CMCR_CKS_BIT    ( 3U )
#define CMT0_CMCR_CMIE_BIT    ( 1U << 6U )
#define CMT1_CMCR_ADDR      ( ( volatile uint16_t  * )0x00088008 )
#define CMT1_CMCR_CKS_BIT    ( 3U )
#define CMT1_CMCR_CMIE_BIT    ( 1U << 6U )
#define CMT2_CMCR_ADDR      ( ( volatile uint16_t  * )0x00088012 )
#define CMT2_CMCR_CKS_BIT    ( 3U)
#define CMT2_CMCR_CMIE_BIT    ( 1U << 6U )
#define CMT3_CMCR_ADDR      ( ( volatile uint16_t  * )0x00088018 )
#define CMT3_CMCR_CKS_BIT    ( 3U )
#define CMT3_CMCR_CMIE_BIT    ( 1U << 6U )
#define CMT0_CMCNT_ADDR      ( ( volatile uint16_t  * )0x00088004 )
#define CMT1_CMCNT_ADDR      ( ( volatile uint16_t  * )0x0008800A )
#define CMT2_CMCNT_ADDR      ( ( volatile uint16_t  * )0x00088014 )
#define CMT3_CMCNT_ADDR      ( ( volatile uint16_t  * )0x0008801A )
#define CMT0_CMCOR_ADDR      ( ( volatile uint16_t  * )0x00088006 )
#define CMT1_CMCOR_ADDR      ( ( volatile uint16_t  * )0x0008800C )
#define CMT2_CMCOR_ADDR      ( ( volatile uint16_t  * )0x00088016 )
#define CMT3_CMCOR_ADDR      ( ( volatile uint16_t  * )0x0008801C )

/*
 * Multi function Pin Controler configration define
 */
#define MPC_PWPR_ADDR          ( ( volatile uint8_t  * )0x0008C11F )
#define MPC_PWPR_PFSWE_BIT     ( 1U << 6 )
#define MPC_PWPR_B0WI_BIT      ( 1U << 7 )
#define MPC_PWPR_PFSW_CLEAR    0U

#define MPC_P00PFS_ADDR        ( ( volatile uint8_t  * )0x0008C140 )
#define MPC_P01PFS_ADDR        ( ( volatile uint8_t  * )0x0008C141 )
#define MPC_P02PFS_ADDR        ( ( volatile uint8_t  * )0x0008C142 )
#define MPC_P03PFS_ADDR        ( ( volatile uint8_t  * )0x0008C143 )
#define MPC_P05PFS_ADDR        ( ( volatile uint8_t  * )0x0008C145 )
#define MPC_P07PFS_ADDR        ( ( volatile uint8_t  * )0x0008C147 )
#define MPC_P10PFS_ADDR        ( ( volatile uint8_t  * )0x0008C148 )
#define MPC_P11PFS_ADDR        ( ( volatile uint8_t  * )0x0008C149 )
#define MPC_P12PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14A )
#define MPC_P13PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14B )
#define MPC_P14PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14C )
#define MPC_P15PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14D )
#define MPC_P16PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14E )
#define MPC_P17PFS_ADDR        ( ( volatile uint8_t  * )0x0008C14F )
#define MPC_P20PFS_ADDR        ( ( volatile uint8_t  * )0x0008C150 )
#define MPC_P21PFS_ADDR        ( ( volatile uint8_t  * )0x0008C151 )
#define MPC_P22PFS_ADDR        ( ( volatile uint8_t  * )0x0008C152 )
#define MPC_P23PFS_ADDR        ( ( volatile uint8_t  * )0x0008C153 )
#define MPC_P24PFS_ADDR        ( ( volatile uint8_t  * )0x0008C154 )
#define MPC_P25PFS_ADDR        ( ( volatile uint8_t  * )0x0008C155 )
#define MPC_P26PFS_ADDR        ( ( volatile uint8_t  * )0x0008C156 )
#define MPC_P27PFS_ADDR        ( ( volatile uint8_t  * )0x0008C157 )
#define MPC_P30PFS_ADDR        ( ( volatile uint8_t  * )0x0008C158 )
#define MPC_P31PFS_ADDR        ( ( volatile uint8_t  * )0x0008C159 )
#define MPC_P32PFS_ADDR        ( ( volatile uint8_t  * )0x0008C15A )
#define MPC_P33PFS_ADDR        ( ( volatile uint8_t  * )0x0008C15B )
#define MPC_P34PFS_ADDR        ( ( volatile uint8_t  * )0x0008C15C )
#define MPC_P40PFS_ADDR        ( ( volatile uint8_t  * )0x0008C160 )
#define MPC_P41PFS_ADDR        ( ( volatile uint8_t  * )0x0008C161 )
#define MPC_P42PFS_ADDR        ( ( volatile uint8_t  * )0x0008C162 )
#define MPC_P43PFS_ADDR        ( ( volatile uint8_t  * )0x0008C163 )
#define MPC_P44PFS_ADDR        ( ( volatile uint8_t  * )0x0008C164 )
#define MPC_P45PFS_ADDR        ( ( volatile uint8_t  * )0x0008C165 )
#define MPC_P46PFS_ADDR        ( ( volatile uint8_t  * )0x0008C166 )
#define MPC_P47PFS_ADDR        ( ( volatile uint8_t  * )0x0008C167 )
#define MPC_P50PFS_ADDR        ( ( volatile uint8_t  * )0x0008C168 )
#define MPC_P51PFS_ADDR        ( ( volatile uint8_t  * )0x0008C169 )
#define MPC_P52PFS_ADDR        ( ( volatile uint8_t  * )0x0008C16A )
#define MPC_P54PFS_ADDR        ( ( volatile uint8_t  * )0x0008C16C )
#define MPC_P55PFS_ADDR        ( ( volatile uint8_t  * )0x0008C16D )
#define MPC_P56PFS_ADDR        ( ( volatile uint8_t  * )0x0008C16E )
#define MPC_P57PFS_ADDR        ( ( volatile uint8_t  * )0x0008C16F )
#define MPC_P60PFS_ADDR        ( ( volatile uint8_t  * )0x0008C170 )
#define MPC_P61PFS_ADDR        ( ( volatile uint8_t  * )0x0008C171 )
#define MPC_P66PFS_ADDR        ( ( volatile uint8_t  * )0x0008C176 )
#define MPC_P67PFS_ADDR        ( ( volatile uint8_t  * )0x0008C177 )
#define MPC_P70PFS_ADDR        ( ( volatile uint8_t  * )0x0008C178 )
#define MPC_P71PFS_ADDR        ( ( volatile uint8_t  * )0x0008C179 )
#define MPC_P72PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17A )
#define MPC_P73PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17B )
#define MPC_P74PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17C )
#define MPC_P75PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17D )
#define MPC_P76PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17E )
#define MPC_P77PFS_ADDR        ( ( volatile uint8_t  * )0x0008C17F )
#define MPC_P80PFS_ADDR        ( ( volatile uint8_t  * )0x0008C180 )
#define MPC_P81PFS_ADDR        ( ( volatile uint8_t  * )0x0008C181 )
#define MPC_P82PFS_ADDR        ( ( volatile uint8_t  * )0x0008C182 )
#define MPC_P83PFS_ADDR        ( ( volatile uint8_t  * )0x0008C183 )
#define MPC_P86PFS_ADDR        ( ( volatile uint8_t  * )0x0008C186 )
#define MPC_P87PFS_ADDR        ( ( volatile uint8_t  * )0x0008C187 )
#define MPC_P90PFS_ADDR        ( ( volatile uint8_t  * )0x0008C188 )
#define MPC_P91PFS_ADDR        ( ( volatile uint8_t  * )0x0008C189 )
#define MPC_P92PFS_ADDR        ( ( volatile uint8_t  * )0x0008C18A )
#define MPC_P93PFS_ADDR        ( ( volatile uint8_t  * )0x0008C18B )
#define MPC_PA0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C190 )
#define MPC_PA1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C191 )
#define MPC_PA2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C192 )
#define MPC_PA3PFS_ADDR        ( ( volatile uint8_t  * )0x0008C193 )
#define MPC_PA4PFS_ADDR        ( ( volatile uint8_t  * )0x0008C194 )
#define MPC_PA5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C195 )
#define MPC_PA6PFS_ADDR        ( ( volatile uint8_t  * )0x0008C196 )
#define MPC_PA7PFS_ADDR        ( ( volatile uint8_t  * )0x0008C197 )
#define MPC_PB0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C198 )
#define MPC_PB1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C199 )
#define MPC_PB2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19A )
#define MPC_PB3PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19B )
#define MPC_PB4PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19C )
#define MPC_PB5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19D )
#define MPC_PB6PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19E )
#define MPC_PB7PFS_ADDR        ( ( volatile uint8_t  * )0x0008C19F )
#define MPC_PC0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A0 )
#define MPC_PC1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A1 )
#define MPC_PC2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A2 )
#define MPC_PC3PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A3 )
#define MPC_PC4PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A4 )
#define MPC_PC5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A5 )
#define MPC_PC6PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A6 )
#define MPC_PC7PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A7 )
#define MPC_PD0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A8 )
#define MPC_PD1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1A9 )
#define MPC_PD2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1AA )
#define MPC_PD3PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1AB )
#define MPC_PD4PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1AC )
#define MPC_PD5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1AD )
#define MPC_PD6PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1AE )
#define MPC_PD7PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1BF )
#define MPC_PE0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B0 )
#define MPC_PE1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B1 )
#define MPC_PE2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B2 )
#define MPC_PE3PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B3 )
#define MPC_PE4PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B4 )
#define MPC_PE5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B5 )
#define MPC_PE6PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B6 )
#define MPC_PE7PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B7 )
#define MPC_PF0PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B8 )
#define MPC_PF1PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1B9 )
#define MPC_PF2PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1BA )
#define MPC_PF5PFS_ADDR        ( ( volatile uint8_t  * )0x0008C1BD )
#define MPC_PFS_PSEL0          0x0
#define MPC_PFS_PSEL1          0x1
#define MPC_PFS_PSEL2          0x2
#define MPC_PFS_PSEL3          0x3
#define MPC_PFS_PSEL4          0x4
#define MPC_PFS_PSEL5          0x5
#define MPC_PFS_PSEL6          0x6
#define MPC_PFS_PSEL7          0x7
#define MPC_PFS_PSEL8          0x8
#define MPC_PFS_PSEL9          0x9
#define MPC_PFS_PSELA          0xA
#define MPC_PFS_PSELB          0xB
#define MPC_PFS_PSELC          0xC
#define MPC_PFS_PSELD          0xD
#define MPC_PFS_PSELE          0xE
#define MPC_PFS_PSELF          0xF
#define MPC_PFS_ISEL           ( 1U << 6 )
#define MPC_PFS_ASEL           ( 1U << 7 )
//address output enable register 0
#define MPC_PFAOE0_ADDR 0x0008C104
#define MPC_PFAOE0_A8E_EN 0x1
#define MPC_PFAOE0_A9E_EN 0x2
#define MPC_PFAOE0_A10E_EN 0x4
#define MPC_PFAOE0_A11E_EN 0x8
#define MPC_PFAOE0_A12E_EN 0x10
#define MPC_PFAOE0_A13E_EN 0x20
#define MPC_PFAOE0_A14E_EN 0x40
#define MPC_PFAOE0_A15E_EN 0x80

//address output enable register 1
#define MPC_PFAOE1_ADDR 0x0008C105
#define MPC_PFAOE1_A16E_EN 0x1
#define MPC_PFAOE1_A17E_EN 0x2
#define MPC_PFAOE1_A18E_EN 0x4
#define MPC_PFAOE1_A19E_EN 0x8
#define MPC_PFAOE1_A20E_EN 0x10
#define MPC_PFAOE1_A21E_EN 0x20
#define MPC_PFAOE1_A22E_EN 0x40
#define MPC_PFAOE1_A23E_EN 0x80

//External bus control register 0
#define MPC_PFBCR0_ADDR      ((volatile uint8_t *)0x0008C106)
#define MPC_PFBCR0_ADRLE_PA07_IO        0x0
#define MPC_PFBCR0_ADRLE_PA07_BUS       0x1
#define MPC_PFBCR0_ADRHMS_PC_SEL   0x0
#define MPC_PFBCR0_ADRHMS_P7PC_SEL 0x2
#define MPC_PFBCR0_ADRHMS_P9_SEL   0x4
#define MPC_PFBCR0_BCLKO_FORCE_OUT 0x8
#define MPC_PFBCR0_DHE_IO       0x0
#define MPC_PFBCR0_DHE_BUS      0x10
#define MPC_PFBCR0_DH32E_IO     0x0
#define MPC_PFBCR0_DH32E_BUS    0x20
#define MPC_PFBCR0_WR1BC1E_IO   0x0
#define MPC_PFBCR0_WR1BC1E_BUS   0x40
#define MPC_PFBCR0_WR32BC32E_IO 0x0
#define MPC_PFBCR0_WR32BC32E_BUS 0x80
//External bus control register 1
#define MPC_PFBCR1_ADDR ((volatile uint8_t *)0x0008C107)
#define MPC_PFBCR1_WATIS_INVALID 0x0
#define MPC_PFBCR1_WATIS_P55 0x1
#define MPC_PFBCR1_WATIS_PC5 0x2
#define MPC_PFBCR1_WATIS_P51 0x3
#define MPC_PFBCR1_ALEOE_DIS 0x0
#define MPC_PFBCR1_ALEOE_EN 0x4
#define MPC_PFBCR1_ALES_P54 0x0
#define MPC_PFBCR1_ALES_P10 0x8
#define MPC_PFBCR1_MDSDE_DIS 0x0
#define MPC_PFBCR1_MDSDE_EN 0x10
#define MPC_PFBCR1_DQM1E_DIS 0x0
#define MPC_PFBCR1_DQM1E_EN 0x40
#define MPC_PFBCR1_SDCLKE_DIS 0x0
#define MPC_PFBCR1_SDCLKE_EN 0x80
/*
 *  I/Oポートのレジスタ及び設定ビット情報
 */
#define PORT0_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C000 )
#define PORT1_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C001 )
#define PORT2_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C002 )
#define PORT3_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C003 )
#define PORT4_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C004 )
#define PORT5_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C005 )
#define PORT6_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C006 )
#define PORT7_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C007 )
#define PORT8_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C008 )
#define PORT9_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C009 )
#define PORTA_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C00A )
#define PORTB_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C00B )
#define PORTC_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C00C )
#define PORTD_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C00D )
#define PORTE_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C00E )
#define PORTF_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C00F )
#define PORTG_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C010 )
#define PORTJ_PDR_ADDR      ( ( volatile uint8_t  * )0x0008C012 )
#define PORT_PDR_B0_BIT      ( 0x01U << 0U )
#define PORT_PDR_B1_BIT      ( 0x01U << 1U )
#define PORT_PDR_B2_BIT      ( 0x01U << 2U )
#define PORT_PDR_B3_BIT      ( 0x01U << 3U )
#define PORT_PDR_B4_BIT      ( 0x01U << 4U )
#define PORT_PDR_B5_BIT      ( 0x01U << 5U )
#define PORT_PDR_B6_BIT      ( 0x01U << 6U )
#define PORT_PDR_B7_BIT      ( 0x01U << 7U )
#define PORT_PDR_B0_OUT      PORT_PDR_B0_BIT
#define PORT_PDR_B1_OUT      PORT_PDR_B1_BIT
#define PORT_PDR_B2_OUT      PORT_PDR_B2_BIT
#define PORT_PDR_B3_OUT      PORT_PDR_B3_BIT
#define PORT_PDR_B4_OUT      PORT_PDR_B4_BIT
#define PORT_PDR_B5_OUT      PORT_PDR_B5_BIT
#define PORT_PDR_B6_OUT      PORT_PDR_B6_BIT
#define PORT_PDR_B7_OUT      PORT_PDR_B7_BIT
#define PORT0_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C020 )
#define PORT1_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C021 )
#define PORT2_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C022 )
#define PORT3_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C023 )
#define PORT4_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C024 )
#define PORT5_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C025 )
#define PORT6_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C026 )
#define PORT7_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C027 )
#define PORT8_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C028 )
#define PORT9_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C029 )
#define PORTA_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C02A )
#define PORTB_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C02B )
#define PORTC_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C02C )
#define PORTD_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C02D )
#define PORTE_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C02E )
#define PORTF_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C02F )
#define PORTG_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C030 )
#define PORTJ_PODR_ADDR      ( ( volatile uint8_t  * )0x0008C032 )
#define PORT_PODR_B0_BIT      ( 0x01U << 0U )
#define PORT_PODR_B1_BIT      ( 0x01U << 1U )
#define PORT_PODR_B2_BIT      ( 0x01U << 2U )
#define PORT_PODR_B3_BIT      ( 0x01U << 3U )
#define PORT_PODR_B4_BIT      ( 0x01U << 4U )
#define PORT_PODR_B5_BIT      ( 0x01U << 5U )
#define PORT_PODR_B6_BIT      ( 0x01U << 6U )
#define PORT_PODR_B7_BIT      ( 0x01U << 7U )
#define PORT0_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C040 )
#define PORT1_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C041 )
#define PORT2_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C042 )
#define PORT3_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C043 )
#define PORT4_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C044 )
#define PORT5_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C045 )
#define PORT6_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C046 )
#define PORT7_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C047 )
#define PORT8_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C048 )
#define PORT9_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C049 )
#define PORTA_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C04A )
#define PORTB_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C04B )
#define PORTC_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C04C )
#define PORTD_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C04D )
#define PORTE_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C04E )
#define PORTF_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C04F )
#define PORTG_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C050 )
#define PORTJ_PIDR_ADDR      ( ( volatile uint8_t  * )0x0008C052 )
#define PORT_PIDR_B0_BIT      ( 0x01U << 0U )
#define PORT_PIDR_B1_BIT      ( 0x01U << 1U )
#define PORT_PIDR_B2_BIT      ( 0x01U << 2U )
#define PORT_PIDR_B3_BIT      ( 0x01U << 3U )
#define PORT_PIDR_B4_BIT      ( 0x01U << 4U )
#define PORT_PIDR_B5_BIT      ( 0x01U << 5U )
#define PORT_PIDR_B6_BIT      ( 0x01U << 6U )
#define PORT_PIDR_B7_BIT      ( 0x01U << 7U )
#define PORT0_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C060 )
#define PORT1_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C061 )
#define PORT2_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C062 )
#define PORT3_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C063 )
#define PORT4_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C064 )
#define PORT5_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C065 )
#define PORT6_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C066 )
#define PORT7_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C067 )
#define PORT8_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C068 )
#define PORT9_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C068 )
#define PORTA_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C06A )
#define PORTB_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C06B )
#define PORTC_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C06C )
#define PORTD_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C06D )
#define PORTE_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C06E )
#define PORTF_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C06F )
#define PORTG_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C070 )
#define PORTJ_PMR_ADDR      ( ( volatile uint8_t  * )0x0008C072 )
#define PORT_PMR_B0_BIT      ( 0x01U << 0U )
#define PORT_PMR_B1_BIT      ( 0x01U << 1U )
#define PORT_PMR_B2_BIT      ( 0x01U << 2U )
#define PORT_PMR_B3_BIT      ( 0x01U << 3U )
#define PORT_PMR_B4_BIT      ( 0x01U << 4U )
#define PORT_PMR_B5_BIT      ( 0x01U << 5U )
#define PORT_PMR_B6_BIT      ( 0x01U << 6U )
#define PORT_PMR_B7_BIT      ( 0x01U << 7U )
#define PORT0_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0C0 )
#define PORT1_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0C1 )
#define PORT2_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0C2 )
#define PORT3_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0C3 )
#define PORT4_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0C4 )
#define PORT5_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0C5 )
#define PORT6_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0C6 )
#define PORT7_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0C7 )
#define PORT8_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0C8 )
#define PORT9_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0C8 )
#define PORTA_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0CA )
#define PORTB_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0CB )
#define PORTC_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0CC )
#define PORTD_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0CD )
#define PORTE_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0CE )
#define PORTF_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0CF )
#define PORTG_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0D0 )
#define PORTJ_PCR_ADDR      ( ( volatile uint8_t  * )0x0008C0D2 )
#define PORT_PCR_B0_BIT      ( 0x01U << 0U )
#define PORT_PCR_B1_BIT      ( 0x01U << 1U )
#define PORT_PCR_B2_BIT      ( 0x01U << 2U )
#define PORT_PCR_B3_BIT      ( 0x01U << 3U )
#define PORT_PCR_B4_BIT      ( 0x01U << 4U )
#define PORT_PCR_B5_BIT      ( 0x01U << 5U )
#define PORT_PCR_B6_BIT      ( 0x01U << 6U )
#define PORT_PCR_B7_BIT      ( 0x01U << 7U )
/*
 *  Device関連の定義
 *  (base address of device)
 */

/*
 * External RAM Address
 */
#define EXT_CS7_RAM_ADDR 0x01000000
#define EXT_CS6_RAM_ADDR 0x02000000
#define EXT_CS5_RAM_ADDR 0x03000000
#define EXT_CS4_RAM_ADDR 0x04000000
#define EXT_CS3_RAM_ADDR 0x05000000
#define EXT_CS2_RAM_ADDR 0x06000000
#define EXT_CS1_RAM_ADDR 0x07000000
#define EXT_SDRAM_ADDR 0x08000000
#define EXT_CS0_RAM_ADDR 0xFF000000

/*
 *  シリアルI/Oの個数
 */
//SCI base address
#define SCI0_BASE_ADDR 0x0008A000
#define SCI1_BASE_ADDR 0x0008A020
#define SCI2_BASE_ADDR 0x0008A040
#define SCI3_BASE_ADDR 0x0008A060
#define SCI4_BASE_ADDR 0x0008A080
#define SCI5_BASE_ADDR 0x0008A0A0
#define SCI6_BASE_ADDR 0x0008A0C0
#define SCI7_BASE_ADDR 0x0008A0E0
#define SCI12_BASE_ADDR 0x0008B300

#define TNUM_SIOP      ( 7 )

//Ethernte device address
//Ethernet mac base address
#define ETHERC0_BASE_ADDR 0x000C0100
#define ETHERC1_BASE_ADDR 0x000C0300
  
//Ethernet DMAC base address
#define EDMAC0_BASE_ADDR 0x000C0000
#define EDMAC1_BASE_ADDR 0x000C0200
#define PTPEDMAC_BASE_ADDR 0x000C0400

//Ethernet PTP base address
#define EPTPC_BASE_ADDR 0x000C4000

#endif  /* TOPPERS_RX64M_H */

